{
  "carpet.category.qca": "QCA",
  "carpet.category.pvp": "PVP",

  "carpet.rule.qcaDebugLog.desc": "Prints more debug info in the debug log.",
  "carpet.rule.commandTpPos.name": "/tppos Command",
  "carpet.rule.commandTpPos.desc": "The /tp command, but only can teleport an entity to a position.",
  "carpet.rule.commandTpPlayer.name": "/tpplayer Command",
  "carpet.rule.commandTpPlayer.desc": "The /tp command, but only can teleport a player to another player.",
  "carpet.rule.tallPlantShearToSmall.desc": "Allow players to shear off tall plants or craft them with shears to create their smaller \"variants.\"\nNote that these \"variants\" are purely for in-game use and have no relation to real-life plants.",
  "carpet.rule.breakDripleafKeepStem.desc": "Changes the behaviour of the stems when top break.\nNow, when the top dripleaf break, the top stem will become dripleaf and keep other stems.",
  "carpet.rule.tooExpensiveLevel.desc": "Changes the repair cost level that can trigger the \"Too Expensive!\" tip in anvil.",
  "carpet.rule.repairCostMultiplier.desc": "Sets the multiplier in calculating next repair cost.",
  "carpet.rule.itemsCanPassThroughChains.desc": "Allow item entities pass through chains.\nFor other entities, there is no difference between the collision box and when the rule is closed.",
  "carpet.rule.easyHopperLimitation.desc": "Allow players to limit only certain types of items by placing (glow) item frames at the top or renaming it to valid Limitations.\nLimitation syntax can be found in the Documents.",
  "carpet.rule.crafterLimitation.desc": "Allow players to limit recipes by placing (glow) item frame at the top or renaming it to valid Limitations.\nAt this time, the crafter only supports recipes that result in items within the (glow) item frame or items that match the Limitation in the custom name.\nLimitation syntax can be found in the Documents.\nNote that the \"top\" side means the side has nine-square grid.",
  "carpet.rule.beaconIncreaseInteractionRange.desc": "Allows beacon to increase players' interaction range when the players are in the range of the beacon.",
  "carpet.rule.beaconIncreaseInteractionRangeValue.desc": "Sets the value for beacon when calculating the increased interaction range if the rule beaconIncreaseInteractionRange is not \"false\".",
  "carpet.rule.pvpDoNotDamageEquipment.desc": "Make equipments not damage during PVP.",
  "carpet.rule.pvpDoNotDamageWeapon.desc": "Make weapon not damage during PVP.",
  "carpet.rule.boneMealDoubleSmallFlowers.desc": "Allow players to use bone meal to double the small flowers."
}